#!/usr/bin/python
# -*- coding: utf-8 -*-

#-----------------------------------------------------------------------
# Генирация рандомного значения пастебина
#
#-----------------------------------------------------------------------

#Импорт модуля
import random;

#Список символов из чего генерим
simbols = ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z","A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z","0","1","2","3","4","5","6","7","8","9","0"];
#Переменная со строкой
s = '';
#Перемешиваем список
random.shuffle(simbols);

#Цикл выводит 100 значений
for d in range(0, 1000):
	#От выводим строки по 8 символов
	for n in range(0, 8):
		#Собираем строку из символов
		s += random.choice(simbols);
	#Выводим ее
	print "/" + s;
	#Обнуляем строку
	s = '';
